package jungsuk.exercise12.eight;


/**
 * 다음의 코드는 '-'를 출력하는 쓰레드와 '|'를 출력하는 쓰레드를 생성해서 실행시킨다. 
 * 이 두 개의 쓰레드가 실행결과처럼 '-'와 '|'를 한 번씩 갈아가며 찍게 하려면 아래의 코드를 어떻게 변경해야 하는가?

실행결과
-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
 *
 */
public class Exercise12_8 {
	public static void main(String args[]) throws InterruptedException {
		Thread6_1 th1 = new Thread6_1();
		Thread6_2 th2 = new Thread6_2();
		
		th1.start();
		th2.start();
	}
}

class Thread6_1 extends Thread {
	public void run() {
		for (int i = 0; i < 300; i++) {
			System.out.print('-');
			yield();	// 자신에게 주어진 실행시간을 다른 쓰레드에게 양보한다.
		}
	}
}

class Thread6_2 extends Thread {
	public void run() {
		for (int i = 0; i < 300; i++) {
			System.out.print('|');
			yield();
		}
	}
}